firn_docs/mathematics/linear_algebra/KBrefOrthogonalDecomposition.tex
% Created 2021-09-27 Mon 11:53
% Intended LaTeX compiler: xelatex
\documentclass[letterpaper]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\setlength{\parindent}{0pt}
\usepackage[margin=1in]{geometry}
\usepackage{fontspec}
\usepackage{svg}
\usepackage{cancel}
\usepackage{indentfirst}
\setmainfont[ItalicFont = LiberationSans-Italic, BoldFont = LiberationSans-Bold, BoldItalicFont = LiberationSans-BoldItalic]{LiberationSans}
\newfontfamily\NHLight[ItalicFont = LiberationSansNarrow-Italic, BoldFont       = LiberationSansNarrow-Bold, BoldItalicFont = LiberationSansNarrow-BoldItalic]{LiberationSansNarrow}
\newcommand\textrmlf[1]{{\NHLight#1}}
\newcommand\textitlf[1]{{\NHLight\itshape#1}}
\let\textbflf\textrm
\newcommand\textulf[1]{{\NHLight\bfseries#1}}
\newcommand\textuitlf[1]{{\NHLight\bfseries\itshape#1}}
\usepackage{fancyhdr}
\pagestyle{fancy}
\usepackage{titlesec}
\usepackage{titling}
\makeatletter
\lhead{\textbf{\@title}}
\makeatother
\rhead{\textrmlf{Compiled} \today}
\lfoot{\theauthor\ \textbullet \ \textbf{2021-2022}}
\cfoot{}
\rfoot{\textrmlf{Page} \thepage}
\renewcommand{\tableofcontents}{}
\titleformat{\section} {\Large} {\textrmlf{\thesection} {|}} {0.3em} {\textbf}
\titleformat{\subsection} {\large} {\textrmlf{\thesubsection} {|}} {0.2em} {\textbf}
\titleformat{\subsubsection} {\large} {\textrmlf{\thesubsubsection} {|}} {0.1em} {\textbf}
\setlength{\parskip}{0.45em}
\renewcommand\maketitle{}
\author{Taproot}
\date{\today}
\title{Axler6.14 Orthogonal Decomposition}
\hypersetup{
 pdfauthor={Taproot},
 pdftitle={Axler6.14 Orthogonal Decomposition},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{orthogonal decomposition}
\label{sec:org23b360b}
An orthogonal decomposition is a way of writing some vector \(v \neq 0 \in V\) as the scaled other vector \(u \in V\) plus an orthogonal component
\begin{quote}
Suppose \(u, v \in V\), with \(v \neq 0\). Set \(c =\frac{\langle u, v \rangle}{\lVert v \rVert^2}\) and \(w = u - cv\). Then,
\[\begin{aligned}
  \langle w, v \rangle = 0\text{   and   } u = cv + w
  \end{aligned}\]
\end{quote}
The important algebra is just setting up a system of equations and noticing that orthogonality implies
\[\begin{aligned}
  0 = \langle u - cv, v \rangle\\
  \implies  0 = \langle u -cv, v \rangle &= \langle u, v \rangle - \langle cv, v \rangle\\
  &= \langle u, v \rangle - c \langle v, v \rangle \\
  &= \langle u, v \rangle - c \lVert v \rVert^2
  \end{aligned}\]
which can then be solved for \(c\)
\section{motivation}
\label{sec:org93dcec3}
If we have some vector \(b\) which is not in the column space of \(A\) (there does not exist \(x : Ax = b\)) but we still want the best "approximation", then we want to take the "closest" approximation. Suppose \(\hat{b}\) is such an approximation, then we want the norm of the difference (\(b-\hat{b}\)) to be minimal. Thus, we want \(b-\hat{b}\) to be orthogonal to the column space of \(A\). This motivates orthogonal decomposition.
\end{document}
